app/controllers/registrations_controller.rb

	def create
		@registrations=User.new(parameters)
		if @registrations.save
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)