app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "eivelez@uc.cl"], ["password", "emilio123"], ["LIMIT", 1]]
---
	def create
		$user = User.find_by(email: session_params[:email], password: session_params[:password])