app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    user=User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "megustaelrat"], ["updated_at", "2019-04-21 02:45:13.499300"], ["id", 30]]
---
	def update
		user=User.find(params[:id])
		if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
		if $user.id.to_i==params[:id].to_i
		  User.destroy(params[:id])